//--створити масив та вивести його в консоль:
//з 5 числових значень
/*
let mas=[1,2,3,4,5];
console.log(mas);
//- з 5 стічкових значень
let mas2=["a","b","c","d","e"];
console.log(mas2);
//з 5 значень стрічкового, числового та булевого типу
let mas3=[1,"b","c",true,false];
console.log(mas3);
*/

//-- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу.
// Вивести в консоль
//- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
/*
for (let i=0; i<10; i++){
    document.write('<div>Text</div>');
}
*/

//- За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
/*
for (let i=0; i<10; i++){
    document.write('<div>'+'Text'+i+'</div>');
}
*/
//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
/*
let i=0;
while (i<20){
    document.write('<h1>'+'hello'+'</h1>')
    i++;
}
*/

//- За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
/*
let i=0;
while (i<20){
    document.write('<h1>'+'hello'+i+'</h1>')
    i++;
}
*/

//- Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
/*
let mas=[1,2,3,4,5,6,7,8,9,10];
for (let i=0; i<10;i++){
    console.log(mas[i]);
}
 */

//- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
/*
let mas=['a','b','c','d','e','f','g','h','i','j'];
for (let i=0; i<10;i++){
    console.log(mas[i]);
}
*/

//- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
/*
let mas=[1,'b','c',true,2,'f',2.56,'h',false,'j'];
for (let i=0; i<10;i++){
    console.log(mas[i]);
}
*/

//- Створити масив з 10 елементів числового, стірчкового і булевого типу.
// За допомогою if та typeof вивести тільки булеві елементи
/*
let mas=[1,'b','c',true, 2,'f',2.56,'h',false,'j'];
for (let i=0; i<10;i++){
    let k=typeof (mas[i]);
    if (k=="boolean"){
        console.log(mas[i]);
    }
}
*/

//- Створити масив з 10 елементів числового, стірчкового і булевого типу.
// За допомогою if та typeof вивести тільки числові елементи
/*
let mas=[1,'b','c',true, 2,'f',2.56,'h',false,'j'];
for (let i=0; i<10;i++){
    let k=typeof (mas[i]);
    if (k=="number"){
        console.log(mas[i]);
    }
}
 */

//- Створити масив з 10 елементів числового, стрічкового і булевого типу.
// За допомогою if та typeof вивести тільки рядкові елементи
/*
let mas=[1,'b','c',true, 2,'f',2.56,'h',false,'j'];
for (let i=0; i<10;i++){
    let k=typeof (mas[i]);
    if (k=="string"){
        console.log(mas[i]);
    }
}
 */

//- Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
// Вивести в консоль всі його елементи в циклі.
/*
let mas=[];
for (let i=0; i<10; i++){
    mas[i]=prompt("Дані");
}
for (let i=0; i<10; i++){
    console.log(mas[i]);
}
*/

//- Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
/*
for (let i=0; i<10; i++) {
    console.log('Крок'+i);
    document.write('Крок'+i+'<br>');
}
 */

//- Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
/*
for (let i=0; i<100; i++) {
    console.log('Крок'+i);
    document.write('Крок'+i+'\n');
}
 */

//- Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
/*
for (let i=0; i<100; i=i+2) {
    console.log('Крок'+i);
    document.write('Крок'+i+'\n');
}
 */

//- Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
/*
for (let i=0; i<100; i++) {
    if (i%2==0){
        console.log('Крок'+i);
        document.write('Крок'+i+'\n');
    }
}
 */

//- Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
/*
for (let i=0; i<100; i++) {
    if (i%2!==0){
        console.log('Крок'+i);
        document.write('Крок'+i+'\n');
    }
}
 */

//- Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
/*
for (let m=0; m<=2; m++){
    for (let s=0; s<=60; s++){
        document.write(m+':'+s+'<br>');
    }
}
 */

//- Відтворити роботу годинника, відрахувавши  2 години 20 хвилини
// (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
/*
    for (let h = 0; h <= 2; h++) {
        for (let m = 0; m < 60; m++){
            for (let s = 0; s < 60; s++) {
                document.write(h + ':' + m + ':' + s + '<br>');
            }
            if(h==2 && m==19){
                break;
            }
        }

    }
*/


//зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.




